ИС_СПОРТ_2022/src/DocumentJournals/СоставУчащихсяСпортивногоУчреждения/СоставУчащихсяСпортивногоУчреждения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal>
  <name>СоставУчащихсяСпортивногоУчреждения</name>
  <registeredDocuments>Document.ИсключениеИзСпортивногоУчреждения</registeredDocuments>
  <registeredDocuments>Document.ЗаявленияНаПриемВСпортивноеУчреждение</registeredDocuments>
  <columns>
    <name>ДатаПриказа</name>
  </columns>
  <columns>
    <name>НомерПриказа</name>
  </columns>
  <columns>
    <name>КраткийСоставСпортсмены</name>
  </columns>
</mdclass:DocumentJournal>

ИС_СПОРТ_2022/src/Documents/ЗаявленияНаПриемВСпортивноеУчреждение/ЗаявленияНаПриемВСпортивноеУчреждение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявленияНаПриемВСпортивноеУчреждение</name>
  <registerRecords>InformationRegister.ПредоставленныеДокументыСпортсменов</registerRecords>
  <registerRecords>InformationRegister.СоставУчащихсяСпортивногоУчреждения</registerRecords>
  <attributes>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.РодителиЗаконныеПредставителиСпортсменов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобенностиРазвитияИЗдоровьяСпортсмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СогласиеНаОбработкуПерсональныхДанныхПолучено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСогласиеНаОбработкуПерсональныхДанных</name>
    <type>
      <types>DocumentRef.СогласиеНаОбработкуПерсональныхДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧерновикЗаявления</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗаявления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявления</name>
    <type>
      <types>EnumRef.СтатусыЗаявленийНаПриемВСпортивноеУчреждение</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоИзВнешнегоИсточника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредоставленныеДокументы</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>CatalogRef.ВидыДокументовДляПриемаВСпортивноеУчреждение</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредоставленаКопия</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФайлДокумента</name>
      <type>
        <types>CatalogRef.ЗаявленияНаПриемВСпортивноеУчреждениеПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/DocumentJournals/СоставУчащихсяСпортивногоУчреждения/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Спортсмен") Тогда
		ТекущийСпортсмен = Параметры.Спортсмен;
		УстановитьОтборПоСпортсменуНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование И ЗначениеЗаполнено(ТекущийСпортсмен) Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("СписокПередНачаломДобавленияЗавершение", ЭтотОбъект);
		Если Параметр = Тип("ДокументСсылка.ЗаявленияНаПриемВСпортивноеУчреждение") Тогда
			ОткрытьФорму("Документ.ЗаявленияНаПриемВСпортивноеУчреждение.Форма.ФормаДокумента", Новый Структура("Спортсмен", ТекущийСпортсмен),,,,,Оповещение);
		Иначе
			ОткрытьФорму("Документ.ИсключениеИзСпортивногоУчреждения.Форма.ФормаДокумента", Новый Структура("Спортсмен", ТекущийСпортсмен),,,,,Оповещение);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборПоСпортсменуНаСервере()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Спортсмен", ТекущийСпортсмен, ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры	

&НаКлиенте
Процедура СписокПередНачаломДобавленияЗавершение(Результат, ДопПараметры) Экспорт
	
	УстановитьОтборПоСпортсменуНаСервере();
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

#КонецОбласти
